export const categoriesTree = [
  {
    name: "Вітальня",
    children: [
      {
        name: "Дивани",
        children: [
          { name: "Кутові дивани" },
          { name: "Одномістні дивани" },
          { name: "Двомістні дивани" },
          { name: "Трьохмістні дивани" }
        ]
      },
      {
        name: "Крісла",
        children: [
          { name: "Крісла-реклайнери" },
          { name: "М'які крісла" },
          { name: "Крісла з підголівником" }
        ]
      },
      {
        name: "Столи",
        children: [
          { name: "Журнальні столи" },
          { name: "Набори столів" }
        ]
      },
      {
        name: "Зберігання",
        children: [
          { name: "Шафи" },
          { name: "Комоди" }
        ]
      }
    ]
  },
  {
    name: "Спальня",
    children: [
      {
        name: "Ліжка",
        children: [
          { name: "З підйомним механізмом" },
          { name: "Двох'ярусне ліжко" },
          { name: "Двоспальне ліжко" },
          { name: "Односпальне ліжко" }
        ]
      },
      {
        name: "Матраци",
        children: [
          { name: "Пінні матраци" },
          { name: "Ортопедичні матраци" },
          { name: "Пружинні матраци" }
        ]
      }
    ]
  },
  {
    name: "Кухня",
    children: [
      {
        name: "Кухонні стільці",
        children: [
          { name: "Барні стільці" },
          { name: "М'які стільці" },
          { name: "Дерев'яні стільці" }
        ]
      },
      {
        name: "Кухонні столи"
      }
    ]
  },
  {
    name: "Офіс",
    children: [
      { name: "Шафи для файлів" },
      {
        name: "Офісні крісла та стільці",
        children: [
          { name: "Ігрові крісла" },
          { name: "Ергономічні стільці" }
        ]
      },
      { name: "Офісні столи" },
      { name: "Офісні полиці та стелажі" }
    ]
  },
  {
    name: "Матеріали",
    children: [
      { name: "Дерево" },
      { name: "Тканина" },
      { name: "Метал" }
    ]
  }
];